/* 
การอัปเดตด็อกคิวเมนต์ (Update)

อัปเดตด็อกคิวเมนต์เดียว
 - เป็นการดึงเอกสารออกมาแก้ไขเพียงรายการเดียวโดยใช้เมธอด updateOne()
 รูปแบบ
  - db.collection_name.updateOne(filter, Update, Options)
   - filter เลือกด็อกคิวเมนต์ที่นำมาแก้ไข หรือการสืบค้นข้อมูล 
   - update กำหนดตัวดำเนินการ (วิธีการแก้ไขข้อมูล) และระบุข้อมูลที่จะนำมาแกไข้
   - options ตัวเลือกเพิ่มเติม

ีupdate --------
{
  <update operator> : { <field1>: <value1>, ... }
  <update operator> : { <firld1>: <value2>, ... }
}

ตัวดำเนินการ
 - $currentDate กำหนดค่าลงในฟิลด์ด้วยวันที่ปัจจุบัน เช่น Date, Timestamp
 - $inc เพิ่มค่าที่อยู่ในฟิลด์ด้วยจำนวนที่ระบุ
 - $min อัปเดตเฉพาะฟิลด์ หากค่าที่กำหนดน้อยกว่าค่าที่ฟิลด์มีอยู่
 - $max อัปเดตเฉพาะฟิลด์ หากค่าที่กำหนดมากกว่าค่าที่ฟิลด์มีอยู่
 - $mul คูณค่าที่อยู่ในฟิลด์ด้วยจำนวนที่ระบุ
 - $rename เปลี่ยนชื่อฟิลด์
 - $set กำหนดค่าลงในฟิลด์ของด็อกคิวเมนต์
 - $setOnInsert กำหนดค่าลงในฟิลด์สำหรับการเพิ่มด็อกคิวเมนต์ ซึ้งไม่มีผลต่อการแก้ไขด็อกคิวเมนต์ที่มีอยู่
 - $unset ถอดฟิลด์ที่ระบุออกจากด็อกคิวเมนต์

*/

// อัปเดตข้อมูลชื่อ piya ที่ field phone เป็น 123456789
db.customer.updateOne({ name: "piya" }, { $set: { phone: "123456789" } });

// ใช้เมธอด findOne() เรียกดูด๊อกคิวเมนต์ที่ได้แก้ไขไปแล้วว่ามีการเปลียนแปลงไหม
db.customer.findOne({ name: "piya" });

// การแก้ไขข้อมูลด้วยตัวดำเนินการ $set เป็นการเพิ่มค่าลงในฟิลด์ที่เราระบุให้กับด็อกคิวเมนต์ และ ยังใช้ในการเพิ่มฟิลด์ข้อมูลให้กับด็อกคิวเมนต์อีกด้วย

// เช่น เราจะเพิ่มฟิลด์หมวดสินค้าหนังสือ cat: "office" ให้กับด็อกคิวเมนต์ที่ฟิลด์ prodName ชื่อ "Word" ที่อยู่ในคอลเล็กชัน product

// เพิ่มฟิลด์ cat: "office" ให้ด็อกคิวเมนต์สินค้า World
db.product.updateOne({ prodName: "World" }, { $set: { cat: "office" } });
db.product.updateOne({ prodName: "Excel" }, { $set: { cat: "office" } });
db.product.updateOne({ prodName: "PowerPoint" }, { $set: { cat: "office" } });
