/* 
การสืบค้นหลายเงื่อนไขโดยใช้ตัวดำเนินการตรรกะ

สืบค้นโดยใช้หลายเงื่อนไขเข้ามาช่วยกลั่นกรองให้ละเอียดขึ้น
$and ต้องตรงกับเงื่อนไขทั้งสอง
$or ตรงกับเงื่อนไขใดเงื่อนไขหนึ่ง
$not ไม่ตรงหรือตรงข้ามกับเงื่อนไข
$nor ไม่ตรงกับเงื่อนไขทั้งสอง

data
{
    "_id": "key",
    "name": "test",
    "age": 46,
    "field": ["programming", "hardware"]
}

$not สืบค้นด๊อกคิวเมนต์ที่ไม่ตรงกับนิพจน์ที่กำหนด รวมทั้งด๊อกคิวเมนต์ที่ไม่มีฟิลด์นั้นด้วย

$gte อายุที่ไม่มากกว่า 42 หรือ เท่ากับ 42

รูปแบบ
{field: {$not: { <operator-expression> }}}
*/
db.writer.find({ age: { $not: { $gte: 42 } } });
