/* 
การสืบค้นหลายเงื่อนไขโดยใช้ตัวดำเนินการตรรกะ

สืบค้นโดยใช้หลายเงื่อนไขเข้ามาช่วยกลั่นกรองให้ละเอียดขึ้น
$and ต้องตรงกับเงื่อนไขทั้งสอง
$or ตรงกับเงื่อนไขใดเงื่อนไขหนึ่ง
$not ไม่ตรงหรือตรงข้ามกับเงื่อนไข
$nor ไม่ตรงกับเงื่อนไขทั้งสอง

data
{
    "_id": "key",
    "name": "test",
    "age": 46,
    "field": ["programming", "hardware"]
}

$nor หาด๊อกคิวเมนต์ที่ไม่ตรงกับเงื่อนไขทั้งหมด ดังตัวอย่าง เราจะสืบค้นด็อกคิวเมรต์ที่ไม่มีชื่อว่า Puri และ อายุ 50ปี

*/
db.writer.find({ $nor: [
    { name: "Puri" },
    { age: 50 }
]});

// ผลลัพธ์ไม่มีด็อกคิวเมนต์ที่ชื่อ Puri และ อายุ 50 ปี