/* 
ประเภทของอินเด็กซ์ใน MongoDB

MongoDB
จัดให้มีอินเด็กซ์ไว้หลายประเภทที่แตกต่างกันเพื่อสนับสนุนเฉพาะชนิดข้อมูลและการสืบค้นแบบ
ต่างๆ

*/

// อินเด็กซ์ฟิลด์เดียว (Single Field)
// ตัวอย่างเพิ่มด็อกคิวเมนต์ลงในคอลเล็กชัน cust

db.cust.insertMany(
[
  {
    name: "bobo",
    age: 54
  },
  {
    name: "zix",
    age: 50
  },
  {
    name: "nan",
    age: 62
  },
  {
    name: "kit",
    age: 18
  },
  {
    name: "som",
    age: 46
  },
  {
    name: "nan",
    age: 35
  },
  {
    name: "rut",
    age: 28
  }
]
)

// สร้างอินเด็กซ์บนฟิลด์ age ในคอลเล็กชัน cust และมีการเรียงลำดับอินเด็กซ์จากน้อยไปมาก
db.cust.createIndex({ age: 1 })

// สุดท้ายแสดงรายการด็อกคิวเมนต์ในคอลเล็กชัน cust ด้วยเมธอด find() พร้อมด้วยการเรียงลำดับ age จากน้อยไปหามาก
db.cust.find().sort({ age: 1 })

// ผลลัพธ์จะแสดงรายการด็อกคิวเมนต์ในคอลเล็กชัน cust โดยใช้การเรียงลำดับในอินเด็กซ์บนฟิลด์ age จากน้อยไปหามาก