/* 
เลือกแสดงฟิลด์ของด็อกคิวเมนต์ที่ได้จากการสืบค้น (Projection)

เราสามารถกำหนดให้ผลลพธ์จากการสืบค้นด๊อกคิวเมนต์ด้วยเมธอด find() และ fineOne() แสดงเฉพาะฟิลด์ที่ต้องการได้ โดยการกำหนด Projection หากกำหนดให้ฟิลด์ใดมีค่า 1 จะแสดงผลเฉพาะฟิลด์นั้น และฟิลด์ใดมีค่า 0 ก็จะไม่แสดผลลัพธ์ของฟิลด์นั้น

รูปแบบ
db.collection_name.find(query, projection)

data
db.stock.insertMany([
    {
    name: "word",
    stock: 568,
    },
    {
    name: "excel",
    stock: 250,
    },
    {
    name: "powerpoint",
    stock: 635,
    },
    {
    name: "outlook",
    stock: 567,
    damage: 23
    },
    {
    name: "access",
    stock: 502,
    damage: 45
    }
])

แสดงด็อกคิวเมนต์ทั้งหมดที่อยู่ในคอลเล็กชั่น stock ด้วยเมธอด find()
db.stock.find()

เปิดแสดงเฉพาะฟิลด์ที่ต้องการ เช่น เราจะสืบค้นด็อกคิวเมนต์ของหนังสือที่มียอดในฟิลด์ stock มากกว่า 500 และเปิดแสดงเฉพาะฟิลด์ name: 1 และ stock: 1 จะไม่แสดงค่าในฟิลด์ damage นั่นหมายความว่า เมื่อกำหนดค่าในฟิลด์ใดเป็น 1 จะแสดงผลลัพธ์เฉพาะฟิลด์นั้น ส่วนฟิลด์ _id เป็น default จะแสดงเสมอ

*/
// $gt มากกว่า
db.stock.find({ stock: { $gt: 500 } }, { name: 1, stock: 1 });
// เราสามารถปิดฟิลด์ที่ไม่ต้องการให้แสดงเช่น _id ได้โดยการกำหนดค่าให้เป็น 0
db.stock.find({ stock: { $gt: 500 } }, { _id: 0, name: 1, stock: 1 });
