/* 


MongoDB
จัดให้มีอินเด็กซ์ไว้หลายประเภทที่แตกต่างกันเพื่อสนับสนุนเฉพาะชนิดข้อมูลและการสืบค้นแบบ
ต่างๆ

*/

/* 

อินเด็กซ์บางส่วน (Partial Indexes)

เป็นอินเด็กซ์เฉพาะสำหรับด็อกคิวเมนต์ในคอลเล็กชันที่ตรงกับการกลั่นกรองด้วยนิพจน์

รูปแบบ
db.collection.createIndex(<key : index type>, {
  partialFilterExpression: { นิพจน์ }
})

*/

// ตัวอย่าง เราต้องการกำหนดคุณสมบัติอินเด็กซ์บางส่วนสำหรับอินเด็กซ์บนฟิลด์ prodName โดยกลั่นกรองเฉพาะด็อกคิวเมนต์ที่ฟิลด์ sales มียอดขายมากกว่า 1500 

db.sales.createIndex(
  { prodName: 1 },
  {
    partialFilterExpression: {
      sales: {
        $gt: 1500
      }
    }
  }
)