/* 

การสร้างอินเด็กซ์

ใช้เมธอด createIndex()
รูปแบบ
db.collection_name.createIndex({ field_name: 1 หรือ -1 })

- field_name ระบุฟิลด์ที่เป็นคีย์ของอินเด็กซ์
- 1 การจัดเรียงลำดับของอินเด็กซ์จากน้อยไปหามาก
- -1 การจัดเรียงลำดับของอินเด็กซ์จากมาไปหาน้อย

*/


// แสดงรายการของด็อกคิวเมนต์ที่จัดเก็บอยู่ในคอลเล็กชัน books
db.books.find()

// หากเราต้องการสร้างอินเด็กซ์บนฟิลด์ _id ในคอลเล็กชัน books สามารถเขียนคำสั่งดังนี้
db.books.createIndex({ _id: 1 })

// numIndexsBefore: 1 คือก่อนรันคำสั่งในคอลเล็กชันได้มีอินเด็กซ์อยู่แล้วจำนวน 1 ฟิลด์นั่นคือ อินเด็กซ์ _id

// numIndexesAfter: 2 คือหลังจากรันคำสั่งสร้างอินเด็กซ์ในคอลเล็กชันได้มีอินเด็กซ์จำนวน 2 ฟิลด์ นั่นก็คือมีอินเด็กซ์ของ sales ถูกสร้างเพิ่มเข้ามา และ ยืนยันด้วย ok: 1 คือมีการสร้างอินเด็กซ์ให้แล้ว 1 ฟิลด์

// หากเรามีการสืบค้นฟิลด์ใดบ่อยๆ เราควรกำหนด index บนฟิลด์นั้น