/* 
การสืบค้นหลายเงื่อนไขโดยใช้ตัวดำเนินการตรรกะ

สืบค้นโดยใช้หลายเงื่อนไขเข้ามาช่วยกลั่นกรองให้ละเอียดขึ้น
$and ต้องตรงกับเงื่อนไขทั้งสอง
$or ตรงกับเงื่อนไขใดเงื่อนไขหนึ่ง
$not ไม่ตรงหรือตรงข้ามกับเงื่อนไข
$nor ไม่ตรงกับเงื่อนไขทั้งสอง

data
{
    "_id": "key",
    "name": "test",
    "age": 46,
    "field": ["programming", "hardware"]
}

$or สืบค้นด๊อกคิวเมนต์ที่ตรงกับเงื่อนไขใดเงื่อนไขหนึ่ง ตัวอย่าง เราจะสืบค้นด๊อกคิวเมนต์ที่ตรงกับเงื่อนไขผู้เขียนมีชื่อว่า Puri หรือ อายุ 50 ปี
*/

db.writer.find({ $or: [{ name: "Puri" }, { age: 50 }] });
