/* 

โมเดลโครงสร้างต้นไม้

การอ้างอิงด้วยลูก (Child References)
 - เพิ่มด๊อกคิวเมนต์ในคอลเล็กชัน books โดยอ้างอิงโหนดลูกที่อยู่ภายใต้โหนดแม่ในฟิลด์ child

*/
db.books.update(
  { _id: "indesign" },
  { $set: { child: [] } }
);

// สืบค้นเพื่อดูข้อมูลของลูกที่อยู่ภายใต้โหนดพ่อแม่ เช่น
db.books.findOne({_id: "publishing"}).child

// เราสามารถกำหนดให้ฟิลด์ child เป็นอินเด็กซ์ที่ใช้อ้างอิงข้อมูลโดยกำหนดค่าเป็น 1 ซึ้งจะช่วยให้ค้นหาข้อมูลด้วยโหนดลูกได้เร็วขึ้น
db.books.createIndex({ child: 1 })

// สืบค้นด๊อกคิวเมนต์พ่อแม่ที่อ้างอิงโหนดลูกในฟิลด์ child
db.books.find({ child: "photoshop" })