/* 
ประเภทของอินเด็กซ์ใน MongoDB

MongoDB
จัดให้มีอินเด็กซ์ไว้หลายประเภทที่แตกต่างกันเพื่อสนับสนุนเฉพาะชนิดข้อมูลและการสืบค้นแบบ
ต่างๆ

*/

/* 
อินเด็กซ์ผสม (Compound Index)

ลำดับของฟิลด์ที่ระบุไว้ในอินเด็กซ์ผสมจะมีความสำคัญ เช่น { name: 1, age: -1 }
อินเด็กซ์จะเรียงลำดับตามชื่อของลูกค้าใน name ก่อนแล้วจึงค่อยจัดเรียงลำดับตามอายุ age


*/

// เริ่มต้นให้ลบอินเด็กซ์ที่สร้างไว้ก่อนหน้านี้ด้วยเมธอด dropIndex() จากนั้นให้สร้างอินเด็กซ์ผสมระบุฟิลด์ตามลำดับ { name: 1, age: -1 }

db.cust.dropIndex({ age: 1 })

db.cust.createIndex({ name: 1, age: -1 })

// เข้าไปดูรายการอินเด็กซ์ที่สร้างใหม่ด้วยเมธอด getIndexes() จะเห็นอินเด็กซ์ผสม {name: 1, age: -1 }
db.cust.getIndexes()

// แสดงรายการด็อกคิวเมนต์ในคอลเล็กชัน cust ด้วยเมธอด find() พร้อมด้วยการเรียงลำดับโดยเริ่มที่ name เรียงจากน้อยไปหามาก แล้วไปที่ age เรียงจากมากไปหาน้อย
db.cust.find().sort({ name: 1, age: -1 })