/* 
ปรับแต่งผลการสืบค้นด็อกคิวเมนต์ (Query Modifiers)

เริ่มต้นจากลำดับที่ต้องการ
เป็นการใช้เมธอด skip() ต่อท้านการสืบค้นด็อกคิวเมนต์เพื่อข้ามไปเลือกด็อกคิวเมนต์ในลำดับที่ต้องการตามค่าในพารามิเตอร์

รูปแบบ
db.collection_name.find().skip(number)

*/

// เช่นเราจะ skip(1) เพื่อแสดงด็อกคิวเมนต์ writer โดยข้ามรายการที่ 1 แล้วให้เลือกรายการที่ 2 เป็นต้นไป

db.writer.find().skip(1)

// เลือกช่วงของด็อกคิวเมนต์ที่ต้องการ เป็นการใช้ skip ข้ามไปยังจุดเริ่มต้นของช่วงและใช้ limit จำกัดจำนวนของด็อกคิวเมนต์ที่ต้องการให้มีอยู่ในช่วง เช่น มี ด็อกคิวเมนต์ 5 รายการ ใน collection stock 

db.stock.find().skip(1).limit(3);