/* 

การรวมข้อมูล Aggregation

เฟรมเวิร์ก Aggregation สำหรับดึงข้อมูลจากด็อกคิวเมนต์ต่างๆ มารวมกลุ่มเข้าด้วยกันแล้วนำมาวิเคราะห์หาผลลัพธ์ที่ต้องการ เช่น
การนำข้อมูลมาหาผลรวม หาค่าเฉลี่ย หาค่าสูงสุด และค่าต่ำสุด

กระบวนการรวมข้อมูล (Pipeline)
การรวมข้อมูล เป็นการนำด็อกคิวเมนต์ต่างๆ จากหลายๆคอลเล็กชันมารวมกันเพื่อวิเคราะห์หาผลลัพธ์ที่ต้องการ ซึ้งเรียกว่า Pipeline

ไปป์ไลน์ จะรวมข้อมูลตั้งแต่ด๊อกคิวเมนต์ต่างๆ จากคอลเล็กชัน และนำไปทำงาน เรียกว่า สเตจในแต่ละส่วนจนได้ค่าผลลัพธ์ออกมา

เช่น
input ด็อกคิวเมนต์จากคอลเล็กชัน -> สเตจ1 -> สเตจ 2 -> สเตจ n -> Output ด็อกคิวเมนต์

ตัวอย่าง การรวมยอดขายหนังสือคอมพิวเตอร์ของหมวดต่างๆ ในปี 2020

input คอลเล็กชั่น sales -> สเตจ 1 การเลือกกลั่นกรองเอาเฉพาะด็อกคิวเมนต์ยอดขายหนังสือปี 2020 -> สเตจ 2 รวมกลุ่มข้อมูลยอดขายหนังสือตามหวด พร้อมด้วยหาผลรวมออกมาเป็นผลลัพธ์ -> ผลลัพธ์


*/
