/* 

โมเดลโครงสร้างต้นไม้

การอ้างอิงด้วยเส้นทางที่ปรากฏ (Materialized Paths)


*/

// เราจะเก็บรหัสเส้นทางลำดับชั้นของข้อมูลไว้ในฟิลด์ path
db.books.update({ _id: "books" }, { $set: { path: null } });

// สืบค้นด็อกคิวเมนต์ในโครงสร้างต้นไม้ทั้งหมดโดยเรียงลำดับตามเส้นทางในฟิลด์ path ในตัวอย่างกำหนด path:1 คือ เรียงลำดับพาธจากเส้นทางน้อยสุดไปหามากสุด
db.books.find().sort({ path: 1 });

// กำหนดรูปแบบของข้อความ (Regular expression) ค้นหาด็อกคิวเมนต์ที่อยู่ในโหมดที่ต้องการ
// เช่น ค้นหาหนังสือที่อยู่ในกลุ่ม graphic
db.books.find({ path: /,graphic,/ });
