/* 

การรวมข้อมูล Aggregation

เมธอดการรวมข้อมูลของไปป์ไลน์
- ใช้เมธอด db.collection.aggregate()
รูปแบบ
db.collection.aggregate([ {<stage>}, ... ])

สเตจ (Stage)
สเตจการทำงานที่ใช้บ่อย

$match กลั่นกรองเอาเฉพาะด็อกคิวเมนต์ที่ตรงตามเงื่อนไขที่ระบุ
$group จัดกลุ่มด็อกคิวเมนต์และสามารถคำนวณค่าเก็บไว้ในเอาต์พุต
$project ส่งผ่านด็อกคิวเมนต์โดยเลือกเอาเฉพาะฟิลด์ที่ระบุ
$sort จัดเรียงด็อกคิวเมนต์ที่ได้รับเข้ามาทั้งหมด
$skip ข้ามด็อกคิวเมนต์ตามจำนวนที่ระบุและส่งที่เหลือออกไป
$limit จำกัดด็อกคิวเมนต์ที่ส่งออกไปตามจำนวนที่ระบุ
$unwind แยกสมาชิกในฟิลด์อาร์เรย์จากอินพุตออกเป็นด็อกคิวเมนต์
$count นับจำนวนด็อกคิวเมนต์ทั้งหมดที่รับเข้ามา
$lookup เรียกดูข้อมูลจากด๊อกคิวเมนต์ที่อยู่คนละคอลเล็กชันกัน


- การเรียกดูข้อมูลโดยระบุเงื่อนไขด้วย $match
$match เป็นการกลั่นกรองเลือกเอาเฉพาะด็อกคิวเมนต์ที่ต้องการตามเงื่อนไขที่ระบุแล้วส่งออกไป มีรูปแบบเหมือนการสืบค้นหรือ query นั่นเอง

รูปแบบ
{$match: { <query> } }

เช่น เราจะเลือกด็อกคิวเมนต์จากคอลเล็กชั่น sales เอาเฉพาะรายการยอดขายหนังสือในปี 2020 ซึ้งจะใช้การกำหนด (Regular expressions) มาช่วยสืบค้นในฟิลด์ date โดยใช้ /2020/ คือ มีข้อความ "2020" อยู่ในฟิลด์ date
*/

db.sales.aggregate([{ $match: { date: /2020/ } }]);
