/* 

การอ้างอิงข้อมูลแบบ One-to-many
  - เราควรเก็บ id อ้างอิงข้อมูลที่มีจำนวนน้อยกว่าอยู่ใน ด็อกคิวเมนต์ของข้อมูลที่มีจำนวนมากกว่า

  เช่น
  ข้อมูลสินค้าหนังสือจะเพิ่มขึ้นเรื่อยๆ ส่วนข้อมูลของผู้จัดจำหน่าย distributor จะคงที่หรือมีน้อย ดังนั้นเมื่อเราแยกเก็บข้อมูลต่างคอลเล็กชันกัน ก็จะอ้างอิง distributor อยู่ใน product

  กลับกัน หากเราเก็บ id ข้อมูลที่มีปริมาณมาก อยู่ในข้อมูลที่มีปริมาณน้อย จะมีผลที่ทำให้เราใช้ array ที่ไม่แน่นอนเพราะจะมีค่าเพิ่มขึ้นเรื่อยๆ 
  
  เช่น
  เรานำ id ของหนังสือที่สามารถเพิ่มได้ไม่จำกัดนำมาอยู่ใน collections ของผู้จัดจำหน่าย
  books: [12222, 122111]


*/

