/* 
ประเภทของอินเด็กซ์ใน MongoDB

MongoDB
จัดให้มีอินเด็กซ์ไว้หลายประเภทที่แตกต่างกันเพื่อสนับสนุนเฉพาะชนิดข้อมูลและการสืบค้นแบบ
ต่างๆ

*/

/* 

อินเด็กซ์ 2dsphere
อินเด็กซ์ 2dsphere จะช่วยสนับสนุนการสืบค้นพิกัดทางภูมิศาสตร์ที่จัดเก็บค่าเป็นละติจุดและลองจิจุดอยู่ในออบเจ็กต์ GeoJSON

รูปแบบ
db.collection.createIndex({<location field> : "2dsphere"})

location field เป็นฟิลด์ที่อยู่ในออบเจ็กต์ของ GeoJSON


*/

// ตัวอย่าง เป็นการสร้างอินเด็กซ์ 2dsphere บนฟิลด์ location ที่อยู่ในออบเจ็กต์ของ GeoJSON เก็บค่าพิกัดตำแหน่งของลูกค้า

db.places.createIndex({
  location: "2dsphere"
})

// เช็คอินเด็กซ์ที่สร้างใหม่ด้วยเมธอด getIndexes() จะเห็นอินเด็กซ์ 2dsphere อยู่บนฟิลด์ location

db.places.getIndexes()

// ตัวอย่างการสืบค้นลูกค้าที่อยู่ไกล้กับบริษัทของเราโซนเมเจอร์สุขุมวิทในตำแหน่งพิกัด 100.5810669, 13.7214849 ในระยะทางระหว่าง 100 - 5000 เมตร

db.places.find(
  {
    location:
    {
      $near: {
        $geometry: {
          type: "Point",
          coordinates: [
            100.5810669,
            13.7214849
          ]
        },
        $minDistance: 100,
        $maxDistance: 5000
      }
    }
  }
)

// $near: เป็นตัวดำเนินการสืบค้นด็อกคิวเมนต์ที่ไกล้กับพิกัดที่ระบุ

// $geometry: ตัวดำเนินการที่ใช้ระบุพิกัดพื้นที่ใช้ร่วมกับ $near: เพื่อใช้ในการสืบค้นพิกัดทางภูมิศาสตร์

// $minDistance เลือกด็อกคิวเมนต์ที่ห่างจากจุดพิกัดไม่น้อยกว่าระยะทางที่ระบุ (เมตร)

// $maxDistance เลือกด็อกคิวเมนต์ที่ห่างจากจุดพิกัดไม่เกินระยะทางที่ระบุ (เมตร)

// เมื่อรันคำสั่งจะได้ผลลัพธ์มีลูกค้า 2 รายการที่มีพิกัดที่ตั้งไกล้กับบริษัทในย่านเมเจอร์สุขุมวิทในระยะทาง 100 - 5,000 เมตร